"""
ДЗ презентации 2, базовый уровень, задача 1.
Время: 15–20 минут.

Тема: переменные, присваивание, print.

Условие:
    Создайте переменные name = "Иван", age = 25, city = "Москва".
    Выведите строку: Иван, 25 лет, Москва.
"""

def main_1():
    name = "Иван"
    age = 25
    city = "Москва"
    print(f"{name}, {age} лет', {city}.")

if __name__ == "__main__":
    main_1()

"""
ДЗ презентации 2, базовый уровень, задача 2.
Время: 15–20 минут.

Тема: арифметические операторы.

Условие:
    Даны числа a = 7 и b = 3.
    Выведите их сумму, разность, произведение, частное,
    целочисленное деление, остаток и возведение в степень.
"""

def main_2():
    a,b = 7,3
    print(f'''Сумма = {a+b}
    Разность = {a-b}
    Произведение = {a*b}
    Частное = {a/b}
    Целочисленное деление = {a//b}
    Остаток = {a%b}
    Возведение в степень 2 = {a**2}
    ''')


if __name__ == "__main__":
    main_2()
