"""
ДЗ презентации 2, повышенный уровень, задача 1.
Время: 20–30 минут.

Тема: арифметические операторы, // и %.

Условие:
    Дано целое число секунд. Переведите его в формат ЧЧ:ММ:СС.
    Используйте только // и %.

Пример:
    In: 3661
    Out: 01:01:01
"""

def seconds_to_hms(seconds: int) -> str:
    hours = seconds // 3600
    minutes = (seconds % 3600) // 60
    seconds = seconds % 60
    return(f'{hours:02}:{minutes:02}:{seconds:02}')


if __name__ == "__main__":
    assert seconds_to_hms(3661) == "01:01:01"
    assert seconds_to_hms(0) == "00:00:00"
    assert seconds_to_hms(59) == "00:00:59"
    assert seconds_to_hms(3600) == "01:00:00"
    print("task_01 (p2 advanced): тесты пройдены")


"""
ДЗ презентации 2, повышенный уровень, задача 2.
Время: 20–30 минут.

Тема: моржовый оператор :=.

Условие:
    Запросите у пользователя число. Используя :=,
    сохраните результат прямо внутри условия if
    и проверьте, что число положительное.

Пример:
    In: 5
    Out: Положительное: 5

    In: -3
    Out: Не положительное
"""

def check_positive():
    if n := int(input()) > 0:
        print ("Положительное")
    else:
        print("Не положительное")


if __name__ == "__main__":
    check_positive()
