"""
ДЗ презентации 4, базовый уровень, задача 2.
Время: 15–20 минут.

Тема: арифметика, форматирование.

Условие:
    Даны длина 12 и ширина 5 прямоугольника.
    Выведите площадь и периметр.
"""

a = 12
b = 5
print(f'Площадь = {a * b}. Периметр = {(a + b) * 2}')

"""
ДЗ презентации 4, базовый уровень, задача 1.
Время: 15–20 минут.

Тема: ввод/вывод, str, int.

Условие:
    Запросите имя, возраст и город.
    Выведите: Иван, 25 лет, Москва.
"""

name = input("Введите имя: ")
age = input("Введите возраст: ")
city = input("Введите город: ")

print(f"{name}, {age}, лет, {city}.")